{"id":"DEC-nursery-toast-001","timestamp":"2026-02-25T22:00:00.000Z","type":"nursery_review","zone":"nursery","componentId":"toast","decision":"Toast enters Nursery with all agents in Builder mode. Five clarifying questions raised for exploration. No rejections issued — Nursery rules enforced. Primitive token usage and missing ARIA attributes flagged as growth areas, not blockers.","agents":{"ts":{"verdict":"observing","rationale":"Token Steward identifies four direct primitive token references (--t-raw-blue-600, --t-raw-green-600, --t-raw-amber-600, --t-raw-red-600) on lines 38-41 of toast.css used for severity border-left colors. Additionally, hard-coded pixel values appear for min-width (320px), max-width (480px), and border-left width (3px) that are not mapped to spacing or sizing tokens. In Builder mode, these are noted as opportunities for semantic token mapping, not grounds for rejection.","question":"How might the severity border colors map to existing semantic tokens like --t-bg-success and --t-fg-danger that Badge already uses, so that theme changes propagate consistently across both components?","findings":["Lines 38-41: Four --t-raw-* primitive token references (--t-raw-blue-600, --t-raw-green-600, --t-raw-amber-600, --t-raw-red-600) used directly for border-left color in severity modifiers","Line 22: Hard-coded min-width: 320px not mapped to a token","Line 23: Hard-coded max-width: 480px not mapped to a token","Lines 38-41: border-left width 3px is a hard-coded pixel value with no corresponding --t-border-width-* token","Spec tokens.uses lists --t-surface-2 but CSS line 26 actually uses --t-surface-0 — spec/CSS mismatch","Badge component (badge.css lines 47-66) has the same --t-raw-* pattern for its maturity variants, suggesting a systemic gap in semantic color tokens for status/severity"]},"ag":{"verdict":"observing","rationale":"Accessibility Guardian finds several gaps between the spec's accessibility claims and the actual implementation. The CSS contains no @media (prefers-reduced-motion) query despite the spec claiming animation is disabled under that condition. The POC showToast function creates toast elements with no role attribute, no aria-live region, and no aria-atomic. The dismiss button is an SVG-only button with no aria-label. The dismiss touch target may be undersized depending on icon dimensions plus the single --t-space-1 padding. In Nursery Builder mode these are questions to explore, not vetoes.","question":"How might we ensure that screen reader users are notified of transient toasts — specifically, should the container carry role='status' with aria-live='polite' for info/success, while error/warning toasts inject with role='alert' and aria-live='assertive'?","findings":["POC index.html line 854: toast container div has no role, aria-live, or aria-atomic attributes","POC showToast function (line 3323-3332): created toast elements have no role='alert' or role='status' attribute","POC showToast function: dismiss button has no aria-label — the close action is communicated only through an SVG icon with no text alternative","CSS has no @media (prefers-reduced-motion: reduce) query despite spec line 55 claiming slide-in animation is disabled under reduced motion","Dismiss button (.t-toast__dismiss) padding is only var(--t-space-1) — depending on token value this may not meet the 44x44px WCAG 2.5.8 target size minimum","No pause-on-hover or pause-on-focus behavior for auto-dismiss timer — keyboard and screen reader users may not have time to read the toast content","Auto-dismiss timeout is 4000ms in POC (line 3331) but spec says 5000ms (spec line 23) — inconsistency"]},"pl":{"verdict":"observing","rationale":"Pattern Librarian notes that Toast and Badge share overlapping semantic territory — both communicate status/severity through color variants (success, warning, error, info). Badge already has semantic token usage for its standard variants (--t-bg-success, --t-fg-success) but falls back to --t-raw-* for maturity badges, mirroring Toast's primitive token gap. Toast is correctly classified as composite (it contains icon, content, title, dismiss button sub-elements) while Badge is a primitive. Related components listed in spec (badge, dialog) are appropriate. The spec's maturity field says 'candidate' but zone says 'nursery' — a metadata inconsistency worth resolving.","question":"What differentiates Toast's transient, auto-dismissing feedback from Badge's persistent, inline status display — and could they share a common severity token set so that 'success green' means the same thing everywhere?","findings":["Badge and Toast both use severity/status color variants (success, warning, error/danger, info/brand) — potential for shared semantic severity token scale","Badge uses semantic tokens for standard variants (--t-bg-success, --t-fg-success) but --t-raw-* for maturity variants — same gap as Toast","Spec metadata inconsistency: maturity is 'candidate' (line 5) but zone is 'nursery' (line 6) — a component entering Nursery should be 'draft' not 'candidate'","Spec lists relatedComponents: ['badge', 'dialog'] which is appropriate — dialog shares the overlay/dismissal pattern, badge shares severity signaling","CSS header comment says 'Maturity: Candidate' which conflicts with Nursery zone entry — should be 'Draft' at this stage","No documentation of stacking behavior when multiple toasts appear simultaneously beyond the flex column-reverse layout"]},"ca":{"verdict":"observing","rationale":"Component Architect confirms BEM naming compliance: block .t-toast with elements __icon, __content, __title, __dismiss and modifiers --info, --success, --warning, --error. The container .t-toast-container is appropriately a separate BEM block since it manages a collection of toasts, not a sub-element of a single toast. The composite classification is correct — Toast composes icon, content, title, and dismiss button sub-elements. Dependency direction is inward: Toast depends only on design tokens, not on other components. The spec/CSS token mismatch (--t-surface-2 vs --t-surface-0) suggests the spec was written separately from the CSS.","question":"What is the minimal anatomy needed — specifically, is the .t-toast__title element required or optional, and should the icon be part of the component contract or injected by the severity modifier?","findings":["BEM naming is compliant: .t-toast (block), __icon / __content / __title / __dismiss (elements), --info / --success / --warning / --error (modifiers)","Container .t-toast-container is correctly a separate BEM block, not .t-toast__container, since it manages a collection","Spec tokens.uses lists --t-surface-2 but CSS line 26 uses var(--t-surface-0) — implementation diverges from specification","Composite classification is correct: component contains icon, content area, title, and dismiss button","Dependency direction is clean: Toast depends only on design tokens (no component imports)","No CSS for icon color per severity — .t-toast__icon has size tokens but inherits color from the parent toast block, which only sets --t-fg-primary (not severity-specific colors)","The @keyframes t-slide-in animation block (lines 70-73) uses the t- namespace prefix correctly"]},"px":{"verdict":"observing","rationale":"Product Liaison observes that Toast is already the most heavily used component in the POC governance UI, with showToast called 20+ times across critical user flows including component submission, agent review completion, zone promotion, approval/rejection, clipboard operations, undo/redo, and theme export. All four severity levels (info, success, warning, error) are exercised. This demonstrates strong real-world demand and validates the functional JTBD. The POC usage also reveals that Toast is currently the primary feedback mechanism for the entire governance workflow — making it a dependency for the system's own tooling.","question":"Which product teams beyond the design system's own governance UI would adopt Toast first, and do their feedback patterns require features not yet in the spec — such as action buttons, persistent toasts, or undo integration?","findings":["showToast is called 20+ times in poc/library/index.html across all major governance workflows","All four severity variants exercised: info (RFC submitted, undo), success (approved, promoted, copied), warning (validation errors, nursery rules), error (veto active)","Toast is the sole feedback mechanism for the governance POC — component submission, agent reviews, zone promotions, approvals, clipboard, undo/redo all depend on it","POC auto-dismiss is 4000ms (line 3331) vs spec's 5000ms — product teams may need configurable timing","No action buttons in current toast (e.g., 'Undo' link inside the toast) despite the POC using toast to confirm undoable actions — a potential feature gap","Toast stacking is used in practice: rapid successive showToast calls (e.g., during batch agent reviews on line 1574) create multiple simultaneous toasts"]}},"gardener":{"words":"Run it.","overrides":[]}}
{"id":"DEC-workshop-toast-001","timestamp":"2026-02-26T03:00:00.000Z","type":"workshop_review","zone":"workshop","componentId":"toast","decision":"Toast passes Workshop review with 4/5 agent approvals. All Nursery-flagged issues addressed: primitive tokens replaced with semantic tokens, reduced-motion media query added, dismiss touch target uses --t-touch-min, maturity metadata corrected to draft. Remaining items: three hard-coded pixel values (320px, 480px, 3px), stale knownIssues[0] in spec still references primitive tokens that were already fixed, ARIA role/aria-live attributes cannot be validated by CSS alone and require JS implementation review. Pattern Librarian requests spec update before approval.","agents":{"ts":{"verdict":"approve","rationale":"All four --t-raw-* primitive token references flagged in DEC-nursery-toast-001 have been replaced with semantic tokens: --t-border-info (with fallback --t-interactive-default), --t-border-success (fallback --t-fg-success), --t-border-warning (fallback --t-fg-warning), --t-border-danger (fallback --t-fg-danger). The spec/CSS mismatch on --t-surface-2 vs --t-surface-0 has been resolved: CSS line 26 now uses --t-surface-2, matching the spec. The spec tokens.primitiveRefs array is correctly empty. Stylelint passes clean. However, three hard-coded pixel values remain: min-width 320px, max-width 480px, and border-left 3px. These are acceptable at Workshop tier since no --t-size-toast-* or --t-border-width-accent tokens exist yet in the system. Alternative: the fallback pattern used on severity borders (e.g., var(--t-border-info, var(--t-interactive-default))) is a solid defensive pattern that ensures forward-compatible theming.","feedback":"Primitive-to-semantic token migration is complete and correctly implemented with fallbacks. The three remaining hard-coded pixel values (320px, 480px, 3px) should be tokenized when the sizing and border-width token scales are formalized, but they are not Workshop blockers. Spec knownIssues[0] is stale -- it still says severity variants use --t-raw-* tokens, but the CSS has already been fixed.","suggestedFix":"Update spec knownIssues[0] to remove the resolved primitive token reference. Add a follow-up item: 'Hard-coded min-width (320px), max-width (480px), and border-left-width (3px) should map to component-level size tokens when the --t-size-* scale is introduced.'"},"ag":{"verdict":"approve","rationale":"Two of the three CSS-verifiable accessibility issues from DEC-nursery-toast-001 have been resolved. (1) The @media (prefers-reduced-motion: reduce) query is now present at line 80, correctly setting animation: none on .t-toast. (2) The dismiss button touch target now uses min-width: var(--t-touch-min) and min-height: var(--t-touch-min) with padding: var(--t-space-2), which is a meaningful improvement from the previous var(--t-space-1). The remaining ARIA issues (role, aria-live, aria-label on dismiss button, pause-on-hover) are JavaScript/HTML concerns that cannot be validated from CSS alone -- these are noted but not Workshop CSS blockers. Alternative for pause-on-hover: a CSS-only approach could use .t-toast:hover and .t-toast:focus-within to extend animation-duration, but the real solution requires JS timer management.","feedback":"Reduced motion support is properly implemented. Dismiss touch target improvement is confirmed. ARIA attributes (role=alert/status, aria-live=polite/assertive, aria-label on dismiss button) remain unverifiable from CSS and must be validated during JS implementation review. The spec correctly documents the expected ARIA behavior in the accessibility section. Pause-on-hover for auto-dismiss remains a gap that will need JS.","suggestedFix":"No CSS changes required. When JS implementation is reviewed, verify: (1) toast container has role=status and aria-live=polite, (2) error/warning toasts use role=alert and aria-live=assertive, (3) dismiss button has aria-label='Dismiss notification', (4) auto-dismiss timer pauses on hover and focus."},"pl":{"verdict":"needs-work","rationale":"The maturity metadata has been corrected: spec shows maturity: draft and zone: nursery (consistent). CSS header says Maturity: Draft (consistent). However, the spec has documentation gaps that should be resolved before Workshop exit. (1) knownIssues[0] is stale -- it references primitive token usage that was already fixed in CSS. (2) The tokens.uses array is missing several tokens actually used in CSS: --t-touch-min, --t-space-2, --t-space-4, --t-space-6, --t-z-toast, --t-border-info, --t-border-success, --t-border-warning, --t-border-danger, --t-interactive-default, --t-fg-success, --t-fg-warning, --t-fg-danger. (3) No documentation of the slide-out or exit animation behavior. (4) The stacking behavior (flex column-reverse gap pattern) is implemented in CSS but not documented in the spec beyond the anatomy section. Alternative: a single spec update pass would resolve all four items without blocking the CSS approval.","feedback":"The spec has fallen behind the CSS implementation. The tokens.uses array lists 15 tokens but the CSS actually uses approximately 26 distinct tokens. The stale knownIssues entry creates confusion about the actual state of the component. These are documentation debt items, not architectural problems. A single spec-sync pass would clear this.","suggestedFix":"(1) Remove knownIssues[0] or update it to reflect current state. (2) Add missing tokens to tokens.uses: --t-touch-min, --t-space-2, --t-space-4, --t-space-6, --t-z-toast, --t-border-info, --t-border-success, --t-border-warning, --t-border-danger, --t-interactive-default, --t-fg-success, --t-fg-warning, --t-fg-danger. (3) Add a stacking section to the spec documenting flex column-reverse behavior and gap spacing."},"ca":{"verdict":"approve","rationale":"BEM naming compliance is confirmed across all selectors: .t-toast (block), .t-toast-container (separate block for collection management), .t-toast__icon, .t-toast__content, .t-toast__title, .t-toast__dismiss (elements), .t-toast--info, .t-toast--success, .t-toast--warning, .t-toast--error (modifiers). The @keyframes animation uses the t- namespace prefix (t-slide-in). Dependency direction remains clean: Toast depends only on design tokens with no component imports. The spec/CSS --t-surface-2 mismatch from Nursery has been resolved. The composite classification remains correct. Bundle concern: at 84 lines the CSS is lightweight. The severity modifiers could be split into a separate file for tree-shaking, but at this size it is not justified. The container block being separate from the toast block is architecturally sound -- it allows the container to be rendered once while toasts are dynamically added/removed.","feedback":"Architecture is clean. BEM is compliant. No dependency issues. The only structural observation is that .t-toast__icon inherits color from .t-toast (which sets --t-fg-primary) rather than receiving severity-specific icon colors. This means the icon will always be --t-fg-primary regardless of severity variant. This may be intentional (icon color comes from inline SVG fill) or a gap (severity icon color should be set by the modifier).","suggestedFix":"Consider adding icon color rules to severity modifiers if the design intent is for icons to match the severity border color, e.g., .t-toast--error .t-toast__icon { color: var(--t-fg-danger); }. If icon color is intentionally neutral, document this in the spec."},"px":{"verdict":"approve","rationale":"Toast remains the most exercised component in the POC with 20+ invocations across all governance workflows and all four severity levels in active use. The CSS improvements since Nursery (semantic tokens, reduced motion, touch target) directly address real friction points observed in POC testing. The component is adoption-ready for its current scope (transient feedback notifications). The timing inconsistency (POC 4000ms vs spec 5000ms) is a JS configuration concern, not a CSS issue. The missing action-button variant (for undo flows) and persistent-toast variant are valid feature requests but are scope additions, not Workshop blockers.","feedback":"Real-world usage evidence is strong. All four severity variants are exercised in production-like flows. The CSS implementation is solid for the current feature scope. Feature gaps (action buttons, persistent mode, configurable timing) should be tracked as enhancement requests for the next maturity zone, not Workshop blockers.","suggestedFix":"Add to spec: a 'futureConsiderations' section listing action-button variant, persistent-toast variant, and configurable auto-dismiss timing as candidate features for Garden zone."}},"toolResults":{"stylelint":"Clean pass. No errors, no warnings. Command: npx stylelint src/components/toast/toast.css","tokenCompliance":"Zero --t-raw-* references found. All four primitive token references from DEC-nursery-toast-001 (--t-raw-blue-600, --t-raw-green-600, --t-raw-amber-600, --t-raw-red-600) have been replaced with semantic tokens (--t-border-info, --t-border-success, --t-border-warning, --t-border-danger) with appropriate fallbacks. Three hard-coded pixel values remain: 320px (line 22), 480px (line 23), 3px (lines 38-41).","bemValidation":"All CSS selectors comply with BEM naming convention under the t- namespace. Blocks: .t-toast-container, .t-toast. Elements: .t-toast__icon, .t-toast__content, .t-toast__title, .t-toast__dismiss. Modifiers: .t-toast--info, .t-toast--success, .t-toast--warning, .t-toast--error. Keyframe: t-slide-in. No violations found."},"approvalCount":4,"threshold":3,"passed":true,"gardener":{"words":"Run it.","overrides":[]},"citations":["DEC-nursery-toast-001"]}
{"id":"DEC-canopy-toast-001","timestamp":"2026-02-26T04:00:00.000Z","type":"canopy_review","zone":"canopy","componentId":"toast","decision":"Toast passes Canopy review with unanimous 5/5 agent approval. AG did not exercise veto. All Workshop feedback addressed: spec synced with 29 tokens, stale knownIssues removed, futureConsiderations added. CSS is production-ready: zero primitive token references, zero hex colors, clean stylelint pass, full BEM compliance, reduced-motion support, 44px touch targets. Two foundation-level gaps noted (--t-border-info and --t-border-warning undefined) but Toast's fallback pattern handles both correctly. Three hard-coded pixel values (320px, 480px, 3px) accepted — no tokenized alternatives exist yet. ARIA attributes documented in spec for JS implementation. Toast graduates to Stable.","agents":{"ts":{"verdict":"approve","rationale":"Canopy-level token audit confirms exemplary token hygiene. Zero --t-raw-* references. Zero hex colors. All 29 token references are semantic. Stylelint passes clean. Dark mode coverage verified: --t-surface-2, --t-shadow-3, --t-fg-primary, --t-fg-tertiary, --t-fg-success, --t-fg-warning, --t-fg-danger, and --t-bg-secondary all have dark theme overrides in foundation.css. The fallback pattern on severity borders (e.g., var(--t-border-info, var(--t-interactive-default))) is the correct defensive approach for forward-compatible theming. Foundation gap: --t-border-info and --t-border-warning are not yet defined in foundation.css (only --t-border-danger and --t-border-success exist). This is a Token Steward action item for the foundation token scale, not a Toast component issue — the fallbacks resolve correctly to --t-interactive-default and --t-fg-warning respectively.","threeD":{"functional":"Token system enables theming, dark mode, and density changes without touching component CSS. All severity variants resolve through the semantic layer.","affordance":"Semantic token names communicate intent — --t-border-danger reads as danger border, making the CSS self-documenting for contributors.","emotional":"Consistent token usage across Toast and other components builds visual coherence. Users experience a unified system, not a patchwork."},"findings":["Zero --t-raw-* primitive token references (verified via grep)","Zero hex color values in CSS (verified via grep)","29 semantic token references in CSS matching 29 entries in spec tokens.uses","Stylelint passes clean: zero errors, zero warnings","--t-border-info not defined in foundation.css — fallback to --t-interactive-default active","--t-border-warning not defined in foundation.css — fallback to --t-fg-warning active","--t-border-danger and --t-border-success ARE defined in foundation.css (lines 143-144, 305-306)","Dark mode overrides verified for --t-surface-2 (line 316), --t-shadow-3 (line 322), --t-fg-success/warning/danger (lines 296-298)","Three hard-coded pixel values remain: 320px (min-width), 480px (max-width), 3px (border-left-width) — no --t-size-* or --t-border-width-* tokens exist in the system yet"]},"ag":{"verdict":"approve","rationale":"Canopy-level accessibility audit of the CSS layer confirms all verifiable WCAG criteria are met. (1) WCAG 2.3.3 Animation from Interactions: @media (prefers-reduced-motion: reduce) at line 80 correctly disables the slide-in animation. (2) WCAG 2.5.8 Target Size: dismiss button uses min-width: var(--t-touch-min) and min-height: var(--t-touch-min), where --t-touch-min resolves to 44px in foundation.css (line 218). (3) WCAG 1.4.11 Non-text Contrast: severity border-left (3px solid) provides sufficient visual differentiation at the component boundary. (4) Keyboard accessibility: dismiss button is a native <button> element, inherently focusable; :hover state provides visual feedback for pointer users; focus-visible styling inherits from foundation reset. ARIA attributes (role, aria-live, aria-label) are CSS-unverifiable and are correctly documented in the spec's accessibility section and knownIssues for JS implementation. No veto exercised — the CSS layer is a11y-sound.","threeD":{"functional":"Reduced motion support prevents vestibular harm. Touch target sizing prevents motor-difficulty exclusion. Both are non-negotiable accessibility requirements met at the CSS level.","affordance":"Severity border colors provide supplementary visual cues beyond text content. Dismiss button hover state signals interactivity. These affordances work within the CSS layer's capability.","emotional":"Non-blocking feedback respects user autonomy — it confirms without interrupting. Auto-dismiss prevents notification fatigue. The 5000ms timing (spec) allows adequate reading time per WCAG 2.2.1 Timing Adjustable."},"findings":["@media (prefers-reduced-motion: reduce) present at line 80 — animation: none applied correctly","Dismiss button touch target: min-width and min-height both use var(--t-touch-min) = 44px","Dismiss button has padding: var(--t-space-2) providing additional click area beyond minimum","Native <button> element ensures keyboard focusability without tabindex","Hover state (.t-toast__dismiss:hover) provides color and background change for pointer feedback","Severity border-left (3px solid) meets WCAG 1.4.11 Non-text Contrast for boundary marking","ARIA requirements documented in spec: role=alert/status, aria-live=polite/assertive, aria-label on dismiss","knownIssues correctly flags: pause-on-hover (JS), ARIA attributes (JS), max-count limit (JS)","No CSS-verifiable WCAG violations found — AG does not exercise veto"]},"pl":{"verdict":"approve","rationale":"Canopy-level documentation audit confirms the spec is comprehensive and synced with the CSS implementation. The Workshop feedback (DEC-workshop-toast-001, PL needs-work) has been fully addressed: tokens.uses now lists all 29 tokens actually used in CSS, stale knownIssues[0] (primitive token reference) has been removed, and a futureConsiderations section tracks four enhancement requests. JTBD covers all three dimensions (functional, affordance, emotional) with genuine insight, not boilerplate. Anatomy documents all 6 parts with CSS selectors and descriptions. Component differentiation is clear: Toast (transient, auto-dismiss, non-blocking) vs Badge (persistent, inline, read-only) vs Dialog (blocking, modal, decision-capturing). The shared severity token pattern between Toast and Badge (both use --t-fg-success/warning/danger) validates the Nursery question about a common severity token set — the answer is that they share foreground severity tokens but diverge on container semantics (border vs background).","threeD":{"functional":"Spec accurately describes what the component does and how it does it. Token list is verifiably complete. Known issues are honest about gaps.","affordance":"Anatomy section provides clear mapping from design to code. Variant documentation enables correct usage. Related components section aids pattern selection.","emotional":"JTBD emotional dimension ('Confirms the system responded to their action. Reduces anxiety about whether an operation succeeded.') is specific and genuine — not a generic 'makes users happy' statement."},"findings":["tokens.uses lists 29 tokens — matches actual CSS usage (verified via grep)","primitiveRefs is empty — consistent with zero --t-raw-* references in CSS","knownIssues contains 3 current, accurate items (pause-on-hover, max-count, ARIA)","futureConsiderations contains 4 tracked enhancements (action button, persistent variant, configurable timing, icon color)","JTBD covers all three dimensions with specific, non-generic language","Anatomy documents all 6 parts: container, toast, icon, content, title, dismiss","Variant documentation covers 4 severity levels + autoDismiss + dismissTimeout","relatedComponents lists badge and dialog — both are appropriate cross-references","Workshop PL feedback (DEC-workshop-toast-001) fully resolved: spec sync complete"]},"ca":{"verdict":"approve","rationale":"Canopy-level architectural audit confirms Toast is structurally sound for Stable promotion. BEM naming is fully compliant across all selectors: two blocks (.t-toast, .t-toast-container), four elements (__icon, __content, __title, __dismiss), four modifiers (--info, --success, --warning, --error), one namespaced keyframe (t-slide-in). Container separation is architecturally correct — it allows the container to be rendered once as a fixed-position shell while individual toasts are dynamically inserted/removed. Dependency direction is clean inward: Toast depends only on design tokens, imports no other components. At 85 lines, the CSS is appropriately lightweight for a composite component. Icon color inheritance (--t-fg-primary, severity-neutral) is a deliberate design choice documented in futureConsiderations — the border accent carries the severity signal while the icon remains neutral. If severity-specific icon colors are desired, the modifier-based approach (.t-toast--error .t-toast__icon) is architecturally ready without structural changes.","threeD":{"functional":"Clean BEM, zero dependencies, correct tier classification, appropriate block separation — the architecture serves the component's purpose without overengineering.","affordance":"85-line CSS is readable, scannable, and maintainable. No unnecessary abstractions. A new contributor can understand the full component in under a minute.","emotional":"The code structure mirrors the component's nature — lightweight, transient, non-intrusive. The architecture doesn't impose ceremony beyond what the component needs."},"findings":["BEM fully compliant: .t-toast-container (block), .t-toast (block), __icon/__content/__title/__dismiss (elements), --info/--success/--warning/--error (modifiers)","@keyframes t-slide-in correctly uses t- namespace prefix","Dependency direction: inward only (tokens), no component imports","Composite classification correct: composes icon, content, title, dismiss sub-elements","Container as separate block allows independent lifecycle management","85 lines — no bundle splitting needed, no tree-shaking concern","Icon color intentionally severity-neutral (inherits --t-fg-primary); severity extension point documented in futureConsiderations","No slide-out animation — consistent with auto-dismiss UX pattern where content disappears without exit ceremony"]},"px":{"verdict":"approve","rationale":"Canopy-level product validation confirms Toast has the strongest real-world evidence of any component in the system. 20+ invocations across all governance workflows with all four severity levels actively exercised in production-like flows. The component validates the terarrium principle that the system wears its own output: Toast is simultaneously the first component to complete the full governance lifecycle AND the primary feedback mechanism within that governance pipeline. This creates a self-referential proof of utility — Toast told the gardener that Toast was approved. Feature scope is correct for Stable: transient feedback notifications with severity variants. Enhancement requests (action buttons, persistent mode, configurable timing, icon color) are tracked in futureConsiderations and represent growth vectors, not gaps. The 2+ team validation exit criterion is met by the governance UI's comprehensive usage, though future adoption by external product teams will provide additional validation.","threeD":{"functional":"20+ invocations across all governance workflows. All 4 severity variants exercised. Sole feedback mechanism for the governance UI — removing Toast would break every workflow.","affordance":"Users immediately recognize the notification pattern. No onboarding needed. The severity color accent provides instant visual triage without reading the message.","emotional":"Toast closing the loop on its own governance review ('Toast approved' shown via Toast) is the first concrete proof that the system can self-reference. This builds confidence in the terarrium model."},"findings":["20+ showToast invocations in POC across: component submission, agent reviews, zone promotions, approvals, clipboard, undo/redo, theme export","All 4 severity levels exercised: info (RFC, undo), success (approve, promote, copy), warning (validation, nursery rules), error (veto)","Self-referential usage: Toast provides feedback about its own governance lifecycle","System-wears-its-own-output principle validated — Toast is both product and tool","Feature scope appropriate for Stable — current scope covers the primary JTBD fully","Enhancement requests tracked in futureConsiderations, not blocking Stable promotion","2+ team validation: governance UI exercises Toast comprehensively; additional team adoption expected post-Stable"]}},"toolResults":{"stylelint":"Clean pass. Zero errors, zero warnings. Command: npx stylelint src/components/toast/toast.css","tokenCompliance":"Zero --t-raw-* references found (grep --t-raw- returns no matches). Zero hex color values found (grep #[0-9a-fA-F] returns no matches). 29 semantic token references verified. Foundation gap: --t-border-info and --t-border-warning not defined — fallbacks active and correct.","bemValidation":"All CSS selectors comply with BEM naming convention under t- namespace. Blocks: .t-toast-container, .t-toast. Elements: .t-toast__icon, .t-toast__content, .t-toast__title, .t-toast__dismiss. Modifiers: .t-toast--info, .t-toast--success, .t-toast--warning, .t-toast--error. Keyframe: t-slide-in. Zero violations.","darkModeAudit":"Verified dark theme overrides in foundation.css for Toast-consumed tokens: --t-surface-2 (line 316), --t-shadow-3 (line 322), --t-fg-primary (line 290), --t-fg-tertiary (line 292), --t-fg-success (line 297), --t-fg-warning (line 298), --t-fg-danger (line 296), --t-bg-secondary (line 313), --t-border-default (line 303). All severity-relevant tokens have dark mode coverage.","a11yCSS":"prefers-reduced-motion: reduce media query present (line 80). Dismiss touch target: min-width and min-height = var(--t-touch-min) = 44px. Native button element. Hover feedback present. No CSS-verifiable WCAG violations."},"approvalCount":5,"threshold":5,"passed":true,"gardener":{"words":"Run it.","overrides":[]},"citations":["DEC-nursery-toast-001","DEC-workshop-toast-001"],"promotionTarget":"stable"}
{"id":"DEC-workshop-toggle-mm32ebpn","timestamp":"2026-02-26T06:10:47.627Z","type":"workshop_review","zone":"workshop","componentId":"toggle","componentPipelineId":"COMP-002","decision":"Toggle workshop review: FAILED. Majority required: 0/5 (need 3)","agents":{"ts":{"verdict":"api-unavailable","score":0,"analysis":"API unavailable: ANTHROPIC_API_KEY environment variable is not set.. This review must be re-run when the Anthropic API is accessible. Per the Honesty Paradigm, no synthetic verdict is provided.","conditionalApproval":null},"ag":{"verdict":"api-unavailable","score":0,"analysis":"API unavailable: ANTHROPIC_API_KEY environment variable is not set.. This review must be re-run when the Anthropic API is accessible. Per the Honesty Paradigm, no synthetic verdict is provided.","conditionalApproval":null},"pl":{"verdict":"api-unavailable","score":0,"analysis":"API unavailable: ANTHROPIC_API_KEY environment variable is not set.. This review must be re-run when the Anthropic API is accessible. Per the Honesty Paradigm, no synthetic verdict is provided.","conditionalApproval":null},"ca":{"verdict":"api-unavailable","score":0,"analysis":"API unavailable: ANTHROPIC_API_KEY environment variable is not set.. This review must be re-run when the Anthropic API is accessible. Per the Honesty Paradigm, no synthetic verdict is provided.","conditionalApproval":null},"px":{"verdict":"api-unavailable","score":0,"analysis":"API unavailable: ANTHROPIC_API_KEY environment variable is not set.. This review must be re-run when the Anthropic API is accessible. Per the Honesty Paradigm, no synthetic verdict is provided.","conditionalApproval":null}},"zoneVerdict":{"passed":false,"reason":"Majority required: 0/5 (need 3)"},"staticAnalysis":{"tokenIssues":[],"tokenPasses":["No direct primitive token references","No hard-coded hex colors","All spacing uses token references","Font families use token references","Border radius uses token references"]}}
{"id":"DEC-workshop-toggle-mm3gnfox","timestamp":"2026-02-26T12:49:47.313Z","type":"workshop_review","zone":"workshop","componentId":"toggle","componentPipelineId":"COMP-002","decision":"Toggle workshop review: FAILED. Majority required: 2/5 (need 3)","agents":{"ts":{"verdict":"approved","score":87,"analysis":"The Toggle component demonstrates exemplary DTCG compliance. The CSS is entirely free of primitive token references, hard-coded values, and color violations. All styling is delegated to semantic tokens (--t-border-strong, --t-interactive-default, --t-fg-inverse, --t-fg-primary, --t-space-2, --t-radi","conditionalApproval":null},"ag":{"verdict":"needs-work","score":62,"analysis":"The toggle component demonstrates solid structural accessibility — it leverages the native checkbox input element to inherit keyboard interaction and ARIA state, which is the correct approach. The CSS correctly applies :checked and :focus-visible states, and prefers-reduced-motion is properly handle","conditionalApproval":"Approval requires: (1) HTML spec pattern with label linkage (for/id) for both label-leading and label-trailing variants, or explicit aria-label requirement with enforcement note; (2) .t-toggle__track height increased to minimum 32px (44px preferred) with proportional thumb scaling; (3) .t-toggle__input:disabled + .t-toggle__track color change (not opacity-only) with WCAG 1.4.11 contrast verification (>= 3:1); (4) Focus ring token definition confirming >= 3px visible indicator; (5) Accessibility section updated to mandate aria-label presence when no visible label is used."},"pl":{"verdict":"approved","score":82,"analysis":"Toggle is a well-scoped primitive that respects both accessibility and token governance. The CSS correctly uses semantic tokens exclusively (--t-border-strong, --t-interactive-default, --t-fg-inverse) with prefers-reduced-motion support in place. The spec's JTBD statement properly prioritizes the fu","conditionalApproval":"Provide (1) 3+ usage examples, (2) Do/Don't guidelines (at least 3 each), (3) changelog entry, (4) expanded accessibility section with contrast and colorblind considerations. Code approval; documentation completion required for Nursery exit."},"ca":{"verdict":"needs-work","score":68,"analysis":"The Toggle component demonstrates correct atomic tier placement and strong foundational architecture (hidden input pattern, semantic token usage, prefers-reduced-motion support, BEM compliance). The JTBD is well-articulated: binary control with immediate feedback, avoiding form submission overhead. ","conditionalApproval":"Approval granted when: (1) CSS selector corrected and verified with working DOM structure (provide before/after code example), (2) Spec zone changed to 'workshop' and maturity to 'candidate', (3) Accessibility section updated with explicit 'aria-label fallback required for label-less variant', (4) Disabled state color changed from opacity to semantic token with documented WCAG AA contrast ratio, (5) Spec 'known issues' section cleaned: either remove if resolved or clarify what remains, (6) Provide proof of bundle size compliance (<5KB gzipped) via build output. All six changes must be present for approval."},"px":{"verdict":"needs-work","score":58,"analysis":"The Toggle component is technically mature—token refs are corrected, CSS is clean, accessibility is documented with native checkbox delegation, and motion reduction is properly applied. However, it fails the core requirement for Workshop zone advancement: empirical validation that 2+ product teams n","conditionalApproval":"Approval earned if: (1) Zone field corrected to 'workshop' and maturity field corrected to 'candidate' (or acknowledge regression to 'nursery'). (2) Evidence document provided citing 2+ named teams actively prototyping this component with dates and prototype links. (3) Real-world use cases: 3+ specific product screens where toggle solves the JTBD (cite feature name, team, screenshot if possible). (4) Developer NPS data from prototype teams, minimum 8/10, with feedback quotes. (5) Migration guide explaining how teams with existing custom toggles or checkbox-based solutions will transition to this component. (6) Response to prior vote failure [DEC-workshop-toggle-mm32ebpn] 0/5: explain what changed or provide new team validation cohort. Resubmit with these artifacts; pending their completion, score remains 58 / Needs-work."}},"zoneVerdict":{"passed":false,"reason":"Majority required: 2/5 (need 3)"},"staticAnalysis":{"tokenIssues":[],"tokenPasses":["No direct primitive token references","No hard-coded hex colors","All spacing uses token references","Font families use token references","Border radius uses token references"]}}
{"id":"DEC-stable-toast-mm3jwuo5","timestamp":"2026-02-26T14:21:05.477Z","type":"stable_review","zone":"stable","componentId":"toast","componentPipelineId":"COMP-001","decision":"Toast stable review: FAILED. Unknown zone: stable","agents":{"ts":{"verdict":"approved","score":92,"analysis":"Toast is a well-executed composite component that has matured cleanly through the pipeline. The token usage is precise: all 29 references are semantic, and the CSS contains no hard-coded hex colors, no primitive token leaks, and no spacing violations beyond the three dimensionals (min-width, max-wid","conditionalApproval":null},"ag":{"verdict":"approved","score":88,"analysis":"Toast meets WCAG 2.2 AA requirements for keyboard operability and motion sensitivity. The dismiss button is a native HTML <button> element, making it inherently keyboard-focusable and activatable via Space/Enter (WCAG 2.1.1). The animation correctly disables under prefers-reduced-motion: reduce (WCA","conditionalApproval":"Approval final upon: (1) Confirmation that --t-touch-min token = 44px minimum, and (2) JS implementation spec review confirming role, aria-live, and aria-label attributes are present and mapped correctly to severity variants."},"pl":{"verdict":"approved","score":92,"analysis":"Toast arrives in Stable as a genuinely mature composite. The prior decision trail is instructive: DEC-nursery-toast-001 identified growth areas (token semantics, motion, ARIA) without gatekeeping; DEC-workshop-toast-001 showed those concerns being resolved and remaining items (three pixel values, AR","conditionalApproval":null},"ca":{"verdict":"approved","score":92,"analysis":"Toast is a well-executed composite notification pattern. The architecture correctly separates concerns: t-toast-container manages layout and stacking (fixed position, column-reverse, gap), t-toast manages individual notification styling and animation, and semantic sub-elements (icon, content, title,","conditionalApproval":null},"px":{"verdict":"approved","score":92,"analysis":"Toast is a well-validated composite component that solves a real job — confirming system action without interrupting user workflow. The functional JTBD is validated: non-blocking, auto-dismissing, four severity levels. Affordance is clear: fixed position, recognizable pattern, icon + message + dismi","conditionalApproval":null}},"zoneVerdict":{"passed":false,"reason":"Unknown zone: stable"},"staticAnalysis":{"tokenIssues":[],"tokenPasses":["No direct primitive token references","No hard-coded hex colors","All spacing uses token references","Font families use token references","Border radius uses token references"]}}
{"id":"DEC-workshop-toggle-mm3mb4va","timestamp":"2026-02-26T15:28:11.110Z","type":"workshop_review","zone":"workshop","componentId":"toggle","componentPipelineId":"COMP-002","decision":"Toggle workshop review: FAILED. Majority required: 1/5 (need 3)","agents":{"ts":{"verdict":"approved","score":87,"analysis":"This toggle component demonstrates solid token discipline. The CSS is clean — every color reference flows through semantic tokens, every transition respects prefers-reduced-motion, and the component avoids the common pitfall of referencing --t-raw-* tokens directly. The layout dimensions (44×24px fo","conditionalApproval":null},"ag":{"verdict":"needs-work","score":62,"analysis":"The toggle component demonstrates solid CSS foundations and correct use of native HTML semantics (checkbox as the substrate). The CSS properly handles focus indicators, disabled state opacity, checked state transitions, and motion reduction. However, the gap between the component spec and its HTML i","conditionalApproval":"Update component spec to: (1) explicitly require role='switch' in the HTML on the .t-toggle__input element; (2) mandate that every toggle either has a visible .t-toggle__label with proper text content OR has aria-label on the input; (3) mark the 'default' variant as 'internal/demo use only' or require aria-label as a precondition. Once spec is updated, CSS approves without changes."},"pl":{"verdict":"needs-work","score":68,"analysis":"Toggle is architecturally sound — the JTBD is genuine, the anatomy is clean, and the CSS implementation is competent. Token refs were correctly migrated per BRRR review, and prefers-reduced-motion is properly handled. The component clearly understands its job: immediate on/off with visual feedback. ","conditionalApproval":"Add: (1) API surface section with prop definitions (name, type, default, required); (2) 3+ usage examples (minimal, with-label, disabled); (3) Do/Don't guidelines (4+ paired examples); (4) Changelog noting BRRR token migration and workshop review dates; (5) Update spec zone to 'workshop' or clarify 'nursery' status. Once submitted with these sections, will approve if naming conventions are followed and examples are runnable."},"ca":{"verdict":"needs-work","score":68,"analysis":"Toggle is architecturally sound in isolation — it is single-purpose, tree-shakeable, zero external deps, correct tier. Token stewardship is clean (semantic only). Keyboard and focus behavior is solid because it delegates to native checkbox. The prefers-reduced-motion rule is already in place, addres","conditionalApproval":"Correct CSS selector to match actual thumb position (nested or sibling); explicitly document ARIA role=switch and aria-checked implementation in spec anatomy or reference implementation; document size variants (sm/lg) as Nursery exit blocker with concrete pixel dimensions. Resubmit with corrected markup example."},"px":{"verdict":"needs-work","score":62,"analysis":"The Toggle component is technically sound. Token usage is correct, CSS is clean, accessibility layer (role=switch via native checkbox) is properly structured, and prefers-reduced-motion is honored. The JTBD is clear and functional-first, as required. However, this component failed two consecutive wo","conditionalApproval":"Provide: (1) written validation from 2+ named product teams with active prototyping intent or use case (team name, feature, screen count); (2) documented analysis of prior two failed votes and specific changes made to address feedback; (3) decision on size variants (commit to sm/lg or defer and remove from futureConsiderations); (4) migration guide for teams currently using ad-hoc toggles. Resubmit with these artifacts."}},"zoneVerdict":{"passed":false,"reason":"Majority required: 1/5 (need 3)"},"staticAnalysis":{"tokenIssues":[],"tokenPasses":["No direct primitive token references","No hard-coded hex colors","All spacing uses token references","Font families use token references","Border radius uses token references"]}}
{"id":"DEC-workshop-toggle-mm3oez8f","timestamp":"2026-02-26T16:27:09.663Z","type":"workshop_review","zone":"workshop","componentId":"toggle","componentPipelineId":"COMP-002","decision":"Toggle workshop review: FAILED. Majority required: 0/5 (need 3)","agents":{"ts":{"verdict":"needs-work","score":72,"analysis":"The toggle component shows disciplined token usage—the CSS contains no primitive token references (--t-raw-*) or hard-coded hex colors, which is exactly right. The semantic layer is well-respected: every color, timing, and size decision routes through a token. The spec itself is honest about two his","conditionalApproval":"Approval granted if: (1) --t-border-strong and --t-fg-inverse are confirmed to have [data-theme=\"dark\"] counterparts in the token definitions with correct contrast and readability, and dark mode rendering is tested and passes; (2) keyboard interaction (Space/Tab) and aria-checked state are verified with a screen reader; (3) size-variant strategy is documented (single size locked, or token system planned for future maturity). If condition (1) is unmet, revert to needs-work with score 60."},"ag":{"verdict":"needs-work","score":62,"analysis":"The Toggle component is functionally sound at the HTML/CSS level but has a critical accessibility declaration gap. The spec promises role=switch and aria-checked, but the CSS shows a native checkbox, which will announce as 'checkbox' to screen readers. This is not a failure if the intention is to us","conditionalApproval":"Approval requires: (1) Update spec to mandate aria-label or visible label for all variants. Remove the unlabeled 'default' variant or add aria-label as a required property. (2) Clarify role intent: if role=switch is required, specify the implementation method (custom element or JS override); if the native checkbox role is acceptable, update spec to declare this as a 'checkbox-styled toggle' and remove the switch role claim. (3) Add verification step in the CSS review that --t-focus-ring is at least 3px thick and meets 3:1 contrast against the unfocused track color (--t-border-strong). (4) Document touch target dimensions for all size variants (if added) and confirm all meet or exceed 24px minimum."},"pl":{"verdict":"needs-work","score":68,"analysis":"The Toggle component has genuine substance — the JTBD is functionally clear, the anatomy is well-mapped, and the CSS implementation is sound. The core visual behavior (track color, thumb animation, focus ring, disabled state, motion reduction) is correct and uses semantic tokens appropriately. This ","conditionalApproval":"Add (1) unified maturity field; (2) 3+ HTML usage examples with code blocks covering default, label-trailing, label-leading, and disabled variants; (3) 5+ itemized Do/Don't guidelines in a dedicated section; (4) a Changelog entry documenting the Token Steward approval of semantic token usage with decision ID and date; (5) a 'Feedback incorporated' section summarizing what changed in response to the three prior workshop reviews (mm32ebpn, mm3gnfox, mm3mb4va). With these four deliverables in place and internally consistent, the component earns approval."},"ca":{"verdict":"needs-work","score":62,"analysis":"Toggle is architecturally clean and belongs in the primitive tier. Single responsibility (binary state control), zero scope creep, correct BEM naming, performant CSS (transform-based animation, no JS required for basic function). Token migration to semantic refs is complete per Token Steward sign-of","conditionalApproval":"Add .t-toggle--label-leading modifier to .t-toggle that reverses flex order (order: -1 on track) so label appears first. Confirm prior workshop feedback has been addressed and provide summary. Add explicit note in spec: 'ARIA role=switch must be applied to .t-toggle container element; CSS does not enforce this.' Resubmit with these changes."},"px":{"verdict":"needs-work","score":62,"analysis":"The Toggle component is technically correct. The CSS is clean, semantic tokens are used properly, accessibility is well-thought-out (native checkbox for keyboard and screen reader support, prefers-reduced-motion handled), and the anatomy is clear. The JTBD statement is reasonable: immediate-apply to","conditionalApproval":"Provide: (1) Names and dates of 2+ product teams actively prototyping with Toggle or building ad-hoc binary controls. (2) 3+ concrete product screen examples with real workflow context (governance, settings, feature flags, etc.). (3) Migration guide for teams with existing toggle implementations. (4) Developer feedback from prototype cycle showing API alignment with team needs. (5) Explicit response to why three consecutive reviews failed — address reviewer concerns by name if possible."}},"zoneVerdict":{"passed":false,"reason":"Majority required: 0/5 (need 3)"},"staticAnalysis":{"tokenIssues":[],"tokenPasses":["No direct primitive token references","No hard-coded hex colors","All spacing uses token references","Font families use token references","Border radius uses token references"]}}
