{
  "nursery": [],
  "workshop": [
    {
      "id": "COMP-002",
      "name": "Toggle",
      "type": "primitive",
      "description": "Binary on/off control that immediately applies a setting change without requiring a separate submit action. JTBD: When I need to enable or disable a setting, I want a control that communicates two discrete states clearly and applies the change immediately, so I can see the effect without submitting a form.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T04:42:00.000Z",
      "movedAt": "2026-02-26T05:00:00.000Z",
      "agentReviews": {
        "ts": {
          "verdict": "needs-work",
          "score": 72,
          "action": "Approved with conditions: (1) Provide evidence that --t-border-strong and --t-fg-inverse are defined with [data-theme=\"dark\"] equivalents and dark mode rendering is correct. (2) Confirm single-size philosophy (document why 44×24px is the canonical size, or commit to a token-driven size variant system before exit). (3) Test keyboard + screen reader: Space toggles state, Tab focuses, aria-checked updates correctly. If all three conditions are met, score rises to 85 (approved). If dark mode tokens are missing, score drops to 60 (needs work).",
          "conditionalApproval": "Approval granted if: (1) --t-border-strong and --t-fg-inverse are confirmed to have [data-theme=\"dark\"] counterparts in the token definitions with correct contrast and readability, and dark mode rendering is tested and passes; (2) keyboard interaction (Space/Tab) and aria-checked state are verified with a screen reader; (3) size-variant strategy is documented (single size locked, or token system planned for future maturity). If condition (1) is unmet, revert to needs-work with score 60.",
          "timestamp": "2026-02-26T16:26:04.637Z"
        },
        "ag": {
          "verdict": "needs-work",
          "score": 62,
          "action": "Needs work. Approval requires: (a) explicit aria-label or mandatory visible label pattern for all variants, with no unlabeled 'default' export; (b) clarity on role (switch vs. checkbox) and implementation of whichever is chosen; (c) verification that focus ring meets 2.4.7 visual requirements (3px+ thickness, 3:1 contrast); (d) confirmation that all touch target sizes meet or exceed 24px CSS px on all variants.",
          "conditionalApproval": "Approval requires: (1) Update spec to mandate aria-label or visible label for all variants. Remove the unlabeled 'default' variant or add aria-label as a required property. (2) Clarify role intent: if role=switch is required, specify the implementation method (custom element or JS override); if the native checkbox role is acceptable, update spec to declare this as a 'checkbox-styled toggle' and remove the switch role claim. (3) Add verification step in the CSS review that --t-focus-ring is at least 3px thick and meets 3:1 contrast against the unfocused track color (--t-border-strong). (4) Document touch target dimensions for all size variants (if added) and confirm all meet or exceed 24px minimum.",
          "timestamp": "2026-02-26T16:26:21.734Z"
        },
        "pl": {
          "verdict": "needs-work",
          "score": 68,
          "action": "Verdict: needs-work. Approval condition: Deliver the four changes above with the following specific outcomes: (a) maturity field unified to single value; (b) 3 runnable HTML examples in a 'Usage' section with code blocks; (c) 5+ itemized Do/Don't guidelines; (d) a 'Changelog' or 'Approvals' section citing the Token Steward decision with ID; (e) a 'Prior feedback' note acknowledging the three failed reviews and documenting specific changes made. Once these are present and coherent, this moves to approved.",
          "conditionalApproval": "Add (1) unified maturity field; (2) 3+ HTML usage examples with code blocks covering default, label-trailing, label-leading, and disabled variants; (3) 5+ itemized Do/Don't guidelines in a dedicated section; (4) a Changelog entry documenting the Token Steward approval of semantic token usage with decision ID and date; (5) a 'Feedback incorporated' section summarizing what changed in response to the three prior workshop reviews (mm32ebpn, mm3gnfox, mm3mb4va). With these four deliverables in place and internally consistent, the component earns approval.",
          "timestamp": "2026-02-26T16:26:38.834Z"
        },
        "ca": {
          "verdict": "needs-work",
          "score": 62,
          "action": "Needs-work: this component cannot advance without (a) confirmation that prior workshop feedback has been addressed, and (b) CSS support for label-leading and label-trailing variants via modifier classes. The architecture itself is sound and the core control is well-built, but the three failed reviews indicate unresolved concerns. Resubmit with: (1) a summary of which prior feedback was addressed, (2) modifier classes for label positioning, and (3) a note in the spec confirming that role=switch is applied at the host element level (not CSS-enforced). With those changes, this earns approval.",
          "conditionalApproval": "Add .t-toggle--label-leading modifier to .t-toggle that reverses flex order (order: -1 on track) so label appears first. Confirm prior workshop feedback has been addressed and provide summary. Add explicit note in spec: 'ARIA role=switch must be applied to .t-toggle container element; CSS does not enforce this.' Resubmit with these changes.",
          "timestamp": "2026-02-26T16:26:55.633Z"
        },
        "px": {
          "verdict": "needs-work",
          "score": 62,
          "action": "Verdict: needs-work. Condition for approval: Provide adoption evidence (2+ named teams prototyping, prototype dates, screen examples) and a migration guide. Without evidence of real need, this remains a well-built component with zero adoption risk — because there is zero adoption. Technical spec is sound; the gate is adoption validation, not code quality.",
          "conditionalApproval": "Provide: (1) Names and dates of 2+ product teams actively prototyping with Toggle or building ad-hoc binary controls. (2) 3+ concrete product screen examples with real workflow context (governance, settings, feature flags, etc.). (3) Migration guide for teams with existing toggle implementations. (4) Developer feedback from prototype cycle showing API alignment with team needs. (5) Explicit response to why three consecutive reviews failed — address reviewer concerns by name if possible.",
          "timestamp": "2026-02-26T16:27:09.661Z"
        }
      },
      "proposals": [],
      "shielded": false,
      "lastReviewedAt": "2026-02-26T16:27:09.662Z",
      "lastZoneVerdict": {
        "passed": false,
        "reason": "Majority required: 0/5 (need 3)"
      }
    },
    {
      "id": "COMP-003",
      "name": "Button",
      "type": "primitive",
      "description": "Submit actions, trigger operations, and navigate between views. The primary interactive element for user-initiated actions. JTBD: When I need to perform an action, I want a clearly interactive element that responds to my click/tap, so I can trigger operations with confidence.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.618Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-004",
      "name": "Input",
      "type": "primitive",
      "description": "Capture user text input with real-time validation feedback. The foundational form element for data entry. JTBD: When I need to enter text data, I want a clearly writable field with validation feedback, so I can submit correct information without guessing.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.618Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-005",
      "name": "Badge",
      "type": "primitive",
      "description": "Convey status, category, or count at a glance. A compact visual indicator that communicates metadata without requiring interaction. JTBD: When I need to understand the state of an item, I want a visible status indicator, so I can assess priority without reading details.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.618Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-006",
      "name": "Avatar",
      "type": "primitive",
      "description": "Represent a person or entity visually. Display a profile image, initials fallback, or placeholder icon at consistent sizes. JTBD: When I see a user reference, I want a visual representation, so I can quickly identify who is involved.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-007",
      "name": "Card",
      "type": "composite",
      "description": "Group related content with clear visual boundaries. A container that establishes content hierarchy through elevation and structure. JTBD: When I encounter related information, I want it visually grouped, so I can process it as a unit without cognitive overhead.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-008",
      "name": "Dialog",
      "type": "composite",
      "description": "Focus user attention on a critical decision or information that requires acknowledgment. Trap keyboard focus within the dialog until dismissed. JTBD: When the system needs my decision, I want focused attention on the choice, so I can respond without distraction.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-009",
      "name": "Tabs",
      "type": "composite",
      "description": "Organize content into switchable views within a single context. Allow users to navigate between related content sections without leaving the page. JTBD: When I have multiple related content sections, I want to switch between them in place, so I can explore without losing context.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-010",
      "name": "Tooltip",
      "type": "primitive",
      "description": "Provide supplementary information about an element on hover or focus. Non-essential context that helps but is not required for the primary task. JTBD: When I am unsure what an element does, I want on-demand clarification, so I can proceed with confidence.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-011",
      "name": "Dropdown",
      "type": "composite",
      "description": "Present a list of options on demand. Allow users to select from a set of actions or choices without cluttering the interface. JTBD: When I need to choose from multiple options, I want them presented on demand, so the interface stays clean until I need them.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.620Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    }
  ],
  "canopy": [],
  "stable": [
    {
      "id": "COMP-001",
      "name": "Toast",
      "type": "composite",
      "description": "Non-blocking feedback about system actions (success, error, warning, info) that auto-dismisses without interrupting workflow. JTBD: When I perform an action, I want immediate confirmation that the system responded, so I can continue my task with confidence.",
      "zone": "stable",
      "maturity": "stable",
      "createdAt": "2026-02-25T21:35:00.000Z",
      "movedAt": "2026-02-26T04:30:00.000Z",
      "agentReviews": {
        "ts": {
          "verdict": "approved",
          "score": 92,
          "action": "Approved for Stable zone. Component has satisfied all prior decision conditions and demonstrates exemplary token stewardship. Zero primitive token violations, full dark mode parity, accessibility scoped correctly, and CSS is production-ready.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:20:05.060Z"
        },
        "ag": {
          "verdict": "approved",
          "score": 88,
          "action": "Approval conditional on: (A) Confirmation that --t-touch-min token value is >= 24px CSS pixels (minimum) or >= 44px (recommended), and (B) JS implementation spec documents and enforces ARIA attributes (role, aria-live, aria-label on dismiss) before production deployment. If both conditions are met, component is approved for Stable zone.",
          "conditionalApproval": "Approval final upon: (1) Confirmation that --t-touch-min token = 44px minimum, and (2) JS implementation spec review confirming role, aria-live, and aria-label attributes are present and mapped correctly to severity variants.",
          "timestamp": "2026-02-26T14:20:22.877Z"
        },
        "pl": {
          "verdict": "approved",
          "score": 92,
          "action": "Approve. Toast is exemplary: it shows a component that was thoughtfully evolved through the pipeline, where each stage's feedback was addressed or explicitly accepted with reasoning. The spec and CSS are in sync, the token list is complete and verified, accessibility is documented for implementation, and the component serves its JTBD clearly.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:20:36.393Z"
        },
        "ca": {
          "verdict": "approved",
          "score": 92,
          "action": "Verdict: Approved. Toast graduates from Workshop to Stable with no conditions. All prior review findings have been addressed. CSS is production-ready. Spec is synced. ARIA concerns are properly delegated to JavaScript implementation review. The component does what it needs to do, in the size it needs to be, with no unnecessary ceremony.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:20:49.583Z"
        },
        "px": {
          "verdict": "approved",
          "score": 92,
          "action": "APPROVED. Toast is ready for production use in Stable zone. No conditional approval needed. Component has been validated through three gate-keepers, all adoption rules met, prior decisions confirm functional maturity and team readiness.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:21:05.475Z"
        }
      },
      "proposals": [],
      "shielded": true,
      "lastReviewedAt": "2026-02-26T14:21:05.476Z",
      "lastZoneVerdict": {
        "passed": false,
        "reason": "Unknown zone: stable"
      }
    }
  ],
  "nextId": 12
}
