{
  "nursery": [],
  "workshop": [
    {
      "id": "COMP-002",
      "name": "Toggle",
      "type": "primitive",
      "description": "Binary on/off control that immediately applies a setting change without requiring a separate submit action. JTBD: When I need to enable or disable a setting, I want a control that communicates two discrete states clearly and applies the change immediately, so I can see the effect without submitting a form.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T04:42:00.000Z",
      "movedAt": "2026-02-26T05:00:00.000Z",
      "agentReviews": {
        "ts": {
          "verdict": "approved",
          "score": 87,
          "action": "APPROVED. The component meets all token steward requirements: zero primitive token violations, full semantic token coverage, correct dark mode architecture, and proper motion reduction handling. The CSS is production-ready. Documentation debt remains: update the spec to reflect that the primitive token issues have been resolved.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T15:27:04.752Z"
        },
        "ag": {
          "verdict": "needs-work",
          "score": 62,
          "action": "Conditional approval: This component moves to APPROVED only if the component spec is updated to (a) explicitly state that role='switch' must be present in the HTML (not implied by native checkbox), (b) mandate that every toggle instance either has a visible .t-toggle__label OR an aria-label on the input, with violation of this rule treated as a component misuse (not a component failure), and (c) document the interactive area as the full .t-toggle container, confirming that users can click anywhere within it. The CSS itself is compliant and requires no changes. Without these clarifications, the component cannot graduate because implementers may produce unlabeled toggles that fail WCAG 4.1.2.",
          "conditionalApproval": "Update component spec to: (1) explicitly require role='switch' in the HTML on the .t-toggle__input element; (2) mandate that every toggle either has a visible .t-toggle__label with proper text content OR has aria-label on the input; (3) mark the 'default' variant as 'internal/demo use only' or require aria-label as a precondition. Once spec is updated, CSS approves without changes.",
          "timestamp": "2026-02-26T15:27:22.057Z"
        },
        "pl": {
          "verdict": "needs-work",
          "score": 68,
          "action": "NEEDS-WORK. Approval condition: (1) API surface documented with prop names, types, defaults, and event signatures; (2) 3+ runnable usage examples showing variants and states; (3) Do/Don't guidelines with 4+ paired recommendations; (4) zone reconciliation (spec says 'nursery', request says 'workshop'); (5) changelog entry. Once these four sections are added and API naming is validated against naming conventions, resubmit for approval.",
          "conditionalApproval": "Add: (1) API surface section with prop definitions (name, type, default, required); (2) 3+ usage examples (minimal, with-label, disabled); (3) Do/Don't guidelines (4+ paired examples); (4) Changelog noting BRRR token migration and workshop review dates; (5) Update spec zone to 'workshop' or clarify 'nursery' status. Once submitted with these sections, will approve if naming conventions are followed and examples are runnable.",
          "timestamp": "2026-02-26T15:27:39.875Z"
        },
        "ca": {
          "verdict": "needs-work",
          "score": 68,
          "action": "Approve when: (A) HTML structure in spec is updated so thumb is nested inside track, CSS selector is corrected, and thumb transform still works; OR CSS selector is rewritten to correctly target sibling thumb. Verify with concrete markup. (B) Spec's accessibility section explicitly states whether role=switch and aria-checked are applied via native checkbox (if input has role=checkbox native behavior) or must be added by implementer (recommended: add both to input and wrap label in role=switch element). (C) Size variants are documented as Nursery exit blocker with specific dimensions (sm: 36×20, lg: 52×28). Component cannot exit draft without these three changes.",
          "conditionalApproval": "Correct CSS selector to match actual thumb position (nested or sibling); explicitly document ARIA role=switch and aria-checked implementation in spec anatomy or reference implementation; document size variants (sm/lg) as Nursery exit blocker with concrete pixel dimensions. Resubmit with corrected markup example.",
          "timestamp": "2026-02-26T15:27:54.151Z"
        },
        "px": {
          "verdict": "needs-work",
          "score": 62,
          "action": "NEEDS WORK. This component will be approved for Workshop when you provide: (a) written validation from 2+ named product teams confirming active prototyping intent or current use case, with team name, feature, and screen count; (b) documented reasons the prior two votes failed, and how you addressed them; (c) decision on size variants (commit now or defer); (d) migration guide for ad-hoc toggle users. Resubmit with these artifacts. Without adoption evidence, this remains a well-crafted ideal, not a load-bearing component.",
          "conditionalApproval": "Provide: (1) written validation from 2+ named product teams with active prototyping intent or use case (team name, feature, screen count); (2) documented analysis of prior two failed votes and specific changes made to address feedback; (3) decision on size variants (commit to sm/lg or defer and remove from futureConsiderations); (4) migration guide for teams currently using ad-hoc toggles. Resubmit with these artifacts.",
          "timestamp": "2026-02-26T15:28:11.108Z"
        }
      },
      "proposals": [],
      "shielded": false,
      "lastReviewedAt": "2026-02-26T15:28:11.108Z",
      "lastZoneVerdict": {
        "passed": false,
        "reason": "Majority required: 1/5 (need 3)"
      }
    },
    {
      "id": "COMP-003",
      "name": "Button",
      "type": "primitive",
      "description": "Submit actions, trigger operations, and navigate between views. The primary interactive element for user-initiated actions. JTBD: When I need to perform an action, I want a clearly interactive element that responds to my click/tap, so I can trigger operations with confidence.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.618Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-004",
      "name": "Input",
      "type": "primitive",
      "description": "Capture user text input with real-time validation feedback. The foundational form element for data entry. JTBD: When I need to enter text data, I want a clearly writable field with validation feedback, so I can submit correct information without guessing.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.618Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-005",
      "name": "Badge",
      "type": "primitive",
      "description": "Convey status, category, or count at a glance. A compact visual indicator that communicates metadata without requiring interaction. JTBD: When I need to understand the state of an item, I want a visible status indicator, so I can assess priority without reading details.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.618Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-006",
      "name": "Avatar",
      "type": "primitive",
      "description": "Represent a person or entity visually. Display a profile image, initials fallback, or placeholder icon at consistent sizes. JTBD: When I see a user reference, I want a visual representation, so I can quickly identify who is involved.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-007",
      "name": "Card",
      "type": "composite",
      "description": "Group related content with clear visual boundaries. A container that establishes content hierarchy through elevation and structure. JTBD: When I encounter related information, I want it visually grouped, so I can process it as a unit without cognitive overhead.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.622Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-008",
      "name": "Dialog",
      "type": "composite",
      "description": "Focus user attention on a critical decision or information that requires acknowledgment. Trap keyboard focus within the dialog until dismissed. JTBD: When the system needs my decision, I want focused attention on the choice, so I can respond without distraction.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-009",
      "name": "Tabs",
      "type": "composite",
      "description": "Organize content into switchable views within a single context. Allow users to navigate between related content sections without leaving the page. JTBD: When I have multiple related content sections, I want to switch between them in place, so I can explore without losing context.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-010",
      "name": "Tooltip",
      "type": "primitive",
      "description": "Provide supplementary information about an element on hover or focus. Non-essential context that helps but is not required for the primary task. JTBD: When I am unsure what an element does, I want on-demand clarification, so I can proceed with confidence.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.619Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    },
    {
      "id": "COMP-011",
      "name": "Dropdown",
      "type": "composite",
      "description": "Present a list of options on demand. Allow users to select from a set of actions or choices without cluttering the interface. JTBD: When I need to choose from multiple options, I want them presented on demand, so the interface stays clean until I need them.",
      "zone": "workshop",
      "maturity": "candidate",
      "createdAt": "2026-02-26T06:10:47.620Z",
      "movedAt": "2026-02-26T06:10:47.623Z",
      "agentReviews": {},
      "proposals": [],
      "shielded": false
    }
  ],
  "canopy": [],
  "stable": [
    {
      "id": "COMP-001",
      "name": "Toast",
      "type": "composite",
      "description": "Non-blocking feedback about system actions (success, error, warning, info) that auto-dismisses without interrupting workflow. JTBD: When I perform an action, I want immediate confirmation that the system responded, so I can continue my task with confidence.",
      "zone": "stable",
      "maturity": "stable",
      "createdAt": "2026-02-25T21:35:00.000Z",
      "movedAt": "2026-02-26T04:30:00.000Z",
      "agentReviews": {
        "ts": {
          "verdict": "approved",
          "score": 92,
          "action": "Approved for Stable zone. Component has satisfied all prior decision conditions and demonstrates exemplary token stewardship. Zero primitive token violations, full dark mode parity, accessibility scoped correctly, and CSS is production-ready.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:20:05.060Z"
        },
        "ag": {
          "verdict": "approved",
          "score": 88,
          "action": "Approval conditional on: (A) Confirmation that --t-touch-min token value is >= 24px CSS pixels (minimum) or >= 44px (recommended), and (B) JS implementation spec documents and enforces ARIA attributes (role, aria-live, aria-label on dismiss) before production deployment. If both conditions are met, component is approved for Stable zone.",
          "conditionalApproval": "Approval final upon: (1) Confirmation that --t-touch-min token = 44px minimum, and (2) JS implementation spec review confirming role, aria-live, and aria-label attributes are present and mapped correctly to severity variants.",
          "timestamp": "2026-02-26T14:20:22.877Z"
        },
        "pl": {
          "verdict": "approved",
          "score": 92,
          "action": "Approve. Toast is exemplary: it shows a component that was thoughtfully evolved through the pipeline, where each stage's feedback was addressed or explicitly accepted with reasoning. The spec and CSS are in sync, the token list is complete and verified, accessibility is documented for implementation, and the component serves its JTBD clearly.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:20:36.393Z"
        },
        "ca": {
          "verdict": "approved",
          "score": 92,
          "action": "Verdict: Approved. Toast graduates from Workshop to Stable with no conditions. All prior review findings have been addressed. CSS is production-ready. Spec is synced. ARIA concerns are properly delegated to JavaScript implementation review. The component does what it needs to do, in the size it needs to be, with no unnecessary ceremony.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:20:49.583Z"
        },
        "px": {
          "verdict": "approved",
          "score": 92,
          "action": "APPROVED. Toast is ready for production use in Stable zone. No conditional approval needed. Component has been validated through three gate-keepers, all adoption rules met, prior decisions confirm functional maturity and team readiness.",
          "conditionalApproval": null,
          "timestamp": "2026-02-26T14:21:05.475Z"
        }
      },
      "proposals": [],
      "shielded": true,
      "lastReviewedAt": "2026-02-26T14:21:05.476Z",
      "lastZoneVerdict": {
        "passed": false,
        "reason": "Unknown zone: stable"
      }
    }
  ],
  "nextId": 12
}
